TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ТекущиеСостоянияСообщений/гкс_ТекущиеСостоянияСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>гкс_ТекущиеСостоянияСообщений</name>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.гкс_СостоянияИсходящихСообщенийRMQ</types>
    </type>
  </resources>
  <dimensions>
    <name>Сообщение</name>
    <type>
      <types>CatalogRef.ИсходящиеСообщения</types>
      <types>CatalogRef.гкс_ВходящиеСообщенияRMQ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипСообщения</name>
    <type>
      <types>EnumRef.гкс_ТипыСообщений</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_СостоянияИсходящихСообщенийRMQ/гкс_СостоянияИсходящихСообщенийRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_СостоянияИсходящихСообщенийRMQ</name>
  <enumValues>
    <name>Подготовлено</name>
  </enumValues>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>Доставлено</name>
  </enumValues>
  <enumValues>
    <name>ДоставленоИОбработано</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиПолучателем</name>
  </enumValues>
  <enumValues>
    <name>Пропущено</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаФормированияСостояния</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОбработкиЗакрыто</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/Enums/гкс_ТипыСообщений/гкс_ТипыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>гкс_ТипыСообщений</name>
  <enumValues>
    <name>ИсходящееСообщение</name>
  </enumValues>
  <enumValues>
    <name>ВходящееСообщение</name>
  </enumValues>
</mdclass:Enum>

TransportManagementDevelop_KAT/Конфигурация/src/InformationRegisters/гкс_ТекущиеСостоянияСообщений/ManagerModule.bsl
#Если ТолстыйКлиентОбычноеПриложение Или Сервер Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура УстановитьСостояниеСообщения(Сообщение, УчастникОбмена, Состояние) Экспорт
	
	Если НЕ ЗначениеЗаполнено(УчастникОбмена) Тогда
		УчастникОбмена = гкс_ОчередьСообщенийRMQВызовСервера.ТекущееПриложение();
	КонецЕсли;
		
	Если НЕ ЗначениеЗаполнено(Состояние) Тогда
		Состояние = Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ОшибкаФормированияСостояния;
	КонецЕсли;
	
	
	ТипСообщения = ТипСообщения(ТипЗнч(Сообщение)); 
	
	СтруктураЗаписи = Новый Структура;
	СтруктураЗаписи.Вставить("Сообщение", Сообщение);
	СтруктураЗаписи.Вставить("УчастникОбмена", УчастникОбмена);
	СтруктураЗаписи.Вставить("Состояние", Состояние);
	СтруктураЗаписи.Вставить("ТипСообщения", ТипСообщения);
		
	гкс_ОбменДаннымиСервер.ДобавитьЗаписьВРегистрСведений(СтруктураЗаписи, "гкс_ТекущиеСостоянияСообщений");
		
КонецПроцедуры

Функция ТипСообщения(Тип)
	
	ТипСообщения = Перечисления.гкс_ТипыСообщений.ПустаяСсылка();
	Если Тип = Тип("СправочникСсылка.ИсходящиеСообщения") Тогда
		ТипСообщения = Перечисления.гкс_ТипыСообщений.ИсходящееСообщение;
	ИначеЕсли Тип = Тип("СправочникСсылка.гкс_ВходящиеСообщенияRMQ") Тогда
		ТипСообщения = Перечисления.гкс_ТипыСообщений.ВходящееСообщение;
	КонецЕсли;
	
	Возврат ТипСообщения;
КонецФункции

#КонецОбласти

#КонецЕсли
